mspm0-rs/mspm0-data-sources/svd/MSPM0G121X.svd
                                            <name>ZERO_LOAD_EVT</name>
                                            <description>Following a zero event (CTR=0) or load event (CTR=LOAD) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO_RC_ZERO_EVT</name>
                                            <description>Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG</name>
                                            <description>On a TRIG pulse, the value stored in CCACTx_y shadow register is loaded into CCACTx_y active register.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2SELU</name>
                                <description>Selects the source second CCU event.</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SEL_CCU0</name>
                                            <description>Selects CCU from CC0.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU1</name>
                                            <description>Selects CCU from CC1.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU2</name>
                                            <description>Selects CCU from CC2.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU3</name>
                                            <description>Selects CCU from CC3.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU4</name>
                                            <description>Selects CCU from CC4.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU5</name>
                                            <description>Selects CCU from CC5.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2SELD</name>
                                <description>Selects the source second CCD event.</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SEL_CCD0</name>
                                            <description>Selects CCD from CC0.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD1</name>
                                            <description>Selects CCD from CC1.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD2</name>
                                            <description>Selects CCD from CC2.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD3</name>
                                            <description>Selects CCD from CC3.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD4</name>
                                            <description>Selects CCD from CC4.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD5</name>
                                            <description>Selects CCD from CC5.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG8_CCCTL_45[%s]</name>
                        <description>Capture or Compare Control Registers 4/5</description>
                        <addressOffset>0x40</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>SCERCNEZ</name>
                                <description>Suppress Compare Event if Repeat Counter is Not Equal to Zero
This bit suppresses the generation of the compare (CCD, CCU and RC) events from
the counter when the repeat counter (RC) value is not 0.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>CCD, CCU and RC events are always generated from the counter when their conditions are generated.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>CCD, CCU and RC events are generated from the counter when their conditions are generated and the RC register value is 0.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCUPD</name>
                                <description>Capture and Compare Update Method
This field controls how updates to the shadow
capture and compare register are performed
(when operating in compare mode, COC=0).</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>Immediately</name>
                                            <description>Writes to the CCx_y register is written to the register directly and has immediate effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Zero_EVT</name>
                                            <description>Following a zero event (CTR=0) Writes to the CCx_y register are stored in shadow register and transferred to ECCx_y in the TIMCLK cycle following CTR equals 0.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Compare_Down_EVT</name>
                                            <description>Following a CCD event (CTR=CC_xy) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Compare_UP_EVT</name>
                                            <description>Following a CCU event (CTR=CC_xy) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO_LOAD_EVT</name>
                                            <description>Following a zero event (CTR=0) or load event (CTR=LOAD) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LD.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO_RC_ZERO_EVT</name>
                                            <description>Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG</name>
                                            <description>Following a TRIG pulse.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y #xD;
0.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG8_OCTL_01[%s]</name>
                        <description>CCP Output Control Registers 0/1</description>
                        <addressOffset>0x50</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCPOINV</name>
                                <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOINV</name>
                                            <description>No inversion</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INV</name>
                                            <description>Invert</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCPIV</name>
                                <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Low</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HIGH</name>
                                            <description>High</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCPO</name>
                                <description>CCP Output Source</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>FUNCVAL</name>
                                            <description>Signal generator value (for example, PWM, triggered PWM)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LOAD</name>
                                            <description>Load event</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CMPVAL</name>
                                            <description>CCU event or CCD event</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO</name>
                                            <description>Zero event</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CAPCOND</name>
                                            <description>Capture event</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FAULTCOND</name>
                                            <description>Fault condition</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC0_MIRROR_ALL</name>
                                            <description>Mirror CCP of first capture and compare register to other capture compare blocks</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC1_MIRROR_ALL</name>
                                            <description>Mirror CCP of second capture and compare register in other capture compare blocks</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DEADBAND</name>
                                            <description>Signal generator output after deadband insertion</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNTDIR</name>
                                            <description>Counter direction</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
