mspm0-rs/mspm0-data-sources/svd/MSPM0G121X.svd
                <register>
                    <name>MATHACL_STATUS</name>
                    <description>Status Register</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UF</name>
                            <description>Underflow Flag</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_UNDERFLOW</name>
                                        <description>No undreflow error.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNDERFLOW</name>
                                        <description>Underflow error.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>OVF</name>
                            <description>Overflow bit for MPY32, SQUARE32, DIV, MAC, and SAC functions
This bit will be set on overflow and will retain its value until cleared by writing 1 into CLR.CLR_OVF</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>ERR</name>
                            <description>Incorrect inputs/outputs.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOERROR</name>
                                        <description>No Error in computation.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIVBY0</name>
                                        <description>DIVBY0 error</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BUSY</name>
                            <description>MATHACL busy bit.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DONE</name>
                                        <description>Compute has completed.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>NOTDONE</name>
                                        <description>Compute ongoing</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>MATHACL_STATUSCLR</name>
                    <description>Status flag clear register</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLR_OVF</name>
                            <description>Write 1 to this bit to clear STATUS.OVF bit</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Writing 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Clear STATUS.OVF</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CLR_UF</name>
                            <description>Write 1 to this bit to clear STATUS.UF bit</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Writing 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Clear STATUS.UF</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CLR_ERR</name>
                            <description>Write 1 to this bit to clear STATUS.ERR field</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Writing 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Clear STATUS.ERR</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
