mspm0-rs/mspm0-data-sources/svd/MSPM0G121X.svd
                    <register>
                        <name>CPUSS_CPU_INT_GROUP0_ICLR</name>
                        <description>Interrupt clear</description>
                        <addressOffset>0x28</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Clears INT in RIS register</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>CPUSS_CPU_INT_GROUP1[%s]</name>
                    <description></description>
                    <addressOffset>0x1130</addressOffset>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP1_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No pending interrupt</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP1_IMASK</name>
                        <description>Interrupt mask</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x000000ff</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Masks the corresponding interrupt</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP1_RIS</name>
                        <description>Raw interrupt status</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Raw interrupt status for INT</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP1_MIS</name>
                        <description>Masked interrupt status</description>
                        <addressOffset>0x18</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Masked interrupt status for INT0</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP1_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Sets INT in RIS register</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
