mspm0-rs/mspm0-data-sources/svd/MSPM0G121X.svd
                <register>
                    <name>UC5_I2CT_IFLS</name>
                    <description>Interrupt FIFO Level Select Register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000022</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>TX FIFO &lt;= 3/4 empty</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>TX FIFO &lt;= 1/2 empty (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>TX FIFO &lt;= 1/4 empty</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_NOT_FULL</name>
                                        <description>Opposite of full</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_EMPTY</name>
                                        <description>TX FIFO is empty</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>TX FIFO &lt;= 1</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>TX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>RX FIFO &gt;= 1/4 full</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>RX FIFO &gt;= 1/2 full (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>RX FIFO &gt;= 3/4 full</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_NOT_EMPTY</name>
                                        <description>Opposite of empty</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_FULL</name>
                                        <description>RX FIFO is full</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>RX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>RX_FIFO &lt;= 1</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable FIFO clear</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable FIFO Clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable FIFO clear</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable FIFO Clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_GFCTL</name>
                    <description>I2C Glitch Filter Control</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>AGFEN</name>
                            <description>Analog Glitch Suppression Enable</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Analog Glitch Filter disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Analog Glitch Filter enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_TTXDATA</name>
                    <description>I2C TXData</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Transmit Data
This byte contains the data to be transferred during the next transaction.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_RXDATA</name>
                    <description>I2C RXData</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Received Data. 
This field contains the last received data.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_PECSR</name>
                    <description>PEC status register</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PECBYTECNT</name>
                            <description>This is the current PEC Byte Count of the State Machine.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x9</bitWidth>
                            </field>
                        <field>
                            <name>PECSTS_CHECK</name>
                            <description>This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>Indicates PEC was not checked in the transaction that occurred before the last Stop</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Indicates PEC was checked in the transaction that occurred before the last Stop</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PECSTS_ERROR</name>
                            <description>This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>Indicates PEC check error did not occurr in the transaction that occurred before the last Stop</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Indicates PEC check error occurred in the transaction that occurred before the last Stop</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_OAR2</name>
                    <description>Own Address 2</description>
                    <addressOffset>0x1148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OAR2</name>
                            <description>Own Address 2This field specifies the alternate OAR2 address.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x7</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>OAR2EN</name>
                            <description>Own Address 2 Enable</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The alternate address is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables the use of the alternate address in the OAR2 field.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>OAR2_MASK</name>
                            <description>Own Address 2 Mask: This field specifies bits A6 through A0 of the Target address.
The bits with value 1 in SOAR2.OAR2_MASK field will make the corresponding incoming address bits to match by default regardless of the value inside SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a dont care.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x7</bitWidth>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_OAR</name>
                    <description>I2C Own Address</description>
                    <addressOffset>0x114C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00004000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OAR</name>
                            <description>Own Address: This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by I2CSOAR.MODE bit, the top 3 bits are don't care</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xA</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>OAREN</name>
                            <description>Own Address Enable</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable OAR address</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable OAR address</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MODE</name>
                            <description>This bit selects the adressing mode to be used.
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MODE7</name>
                                        <description>Enable 7-bit addressing</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MODE10</name>
                                        <description>Enable 10-bit addressing</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_I2CT_TIMEOUT_CNT</name>
                    <description>I2C Timeout Count Register</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00020002</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TCNTA</name>
                            <description>Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>TCNTB</name>
                            <description>Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            </field>
                    </fields>
                </register>
