mspm0-rs/mspm0-data-sources/svd/MSPM0G121X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FLASHCTL</name>
            <groupName>FLASHCTL</groupName>
            <version>1.0</version>
            <description>NVMNW_A2256</description>
            <baseAddress>0x400CD000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FLASHCTL_IIDX</name>
                    <description>Interrupt Index Register</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STAT</name>
                            <description>Indicates which interrupt has fired. 0x0 means no event pending. The priority order is fixed. On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flags in the RIS and MIS are cleared as well. After a read from the CPU (not from the debug interface), the register must be updated with the next highest priority interrupt.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INTR</name>
                                        <description>No Interrupt Pending</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DONE</name>
                                        <description>DONE Interrupt Pending</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_IMASK</name>
                    <description>Interrupt Mask Register</description>
                    <addressOffset>0x1028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DONE</name>
                            <description>Interrupt mask for DONE:
0: Interrupt is disabled in MIS register
1: Interrupt is enabled in MIS register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>Interrupt is masked out</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description>Interrupt will request an interrupt service routine and corresponding bit in [IPSTANDARD.MIS] will be set</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_RIS</name>
                    <description>Raw Interrupt Status Register</description>
                    <addressOffset>0x1030</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DONE</name>
                            <description>Flash wrapper operation completed.
This interrupt bit is set by firmware or the corresponding bit in the ISET register.
It is cleared by the corresponding bit in in the ICLR register or reading the IIDX register when this interrupt is the highest priority.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Interrupt did not occur</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Interrupt occurred</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_MIS</name>
                    <description>Masked Interrupt Status Register</description>
                    <addressOffset>0x1038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DONE</name>
                            <description>Flash wrapper operation completed.
This masked interrupt bit reflects the bitwise AND of the corresponding RIS and IMASK bits.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Masked interrupt did not occur</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Masked interrupt occurred</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_ISET</name>
                    <description>Interrupt Set Register</description>
                    <addressOffset>0x1040</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>DONE</name>
                            <description>0: No effect
1: Set the DONE interrupt in the RIS register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Writing a 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Set [IPSTANDARD.RIS] bit</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_ICLR</name>
                    <description>Interrupt Clear Register</description>
                    <addressOffset>0x1048</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>DONE</name>
                            <description>0: No effect
1: Clear the DONE interrupt in the RIS register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Writing a 0 has no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Clear [IPSTANDARD.RIS] bit</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>INT0_CFG</name>
                            <description>Event line mode select for peripheral event</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. Hardware must clear the RIS.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_DESC</name>
                    <description>Hardware Version Description Register</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor Revision</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major Revision</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance number</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature set</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module ID</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDEXEC</name>
                    <description>Command Execute Register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Command Execute value
Initiates execution of the command specified in the CMDTYPE register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOEXECUTE</name>
                                        <description>Command will not execute or is not executing in flash wrapper</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXECUTE</name>
                                        <description>Command will execute or is executing in flash wrapper</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDTYPE</name>
                    <description>Command Type Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>COMMAND</name>
                            <description>Command type</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOOP</name>
                                        <description>No Operation</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PROGRAM</name>
                                        <description>Program</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASE</name>
                                        <description>Erase</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READVERIFY</name>
                                        <description>ReadVerify - Perform a standalone ReadVerify operation.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MODECHANGE</name>
                                        <description>Mode Change - Perform a mode change only, no other operation.</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLEARSTATUS</name>
                                        <description>Clear Status - Clear status bits in FW_SMSTAT only.</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKVERIFY</name>
                                        <description>Blank Verify - Check whether a flash word is in the erased state.
This command may only be used with CMDTYPE.SIZE = ONEWORD</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SIZE</name>
                            <description>Command size</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ONEWORD</name>
                                        <description>Operate on 1 flash word</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TWOWORD</name>
                                        <description>Operate on 2 flash words</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FOURWORD</name>
                                        <description>Operate on 4 flash words</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHTWORD</name>
                                        <description>Operate on 8 flash words</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SECTOR</name>
                                        <description>Operate on a flash sector</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK</name>
                                        <description>Operate on an entire flash bank</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
