mspm0-rs/mspm0-data-sources/svd/MSPM0G121X.svd
                <register>
                    <dim>12</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11</dimArrayIndex>
                    <name>ADC0_MEMCTL[%s]</name>
                    <description>Conversion Memory Control Register</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANSEL</name>
                            <description>Input channel select.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CHAN_0</name>
                                        <description>Selects channel 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_1</name>
                                        <description>Selects channel 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_2</name>
                                        <description>Selects channel 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_3</name>
                                        <description>Selects channel 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_4</name>
                                        <description>Selects channel 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_5</name>
                                        <description>Selects channel 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_6</name>
                                        <description>Selects channel 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_7</name>
                                        <description>Selects channel 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_8</name>
                                        <description>Selects channel 8</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_9</name>
                                        <description>Selects channel 9</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_10</name>
                                        <description>Selects channel 10</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_11</name>
                                        <description>Selects channel 11</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_12</name>
                                        <description>Selects channel 12</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_13</name>
                                        <description>Selects channel 13</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_14</name>
                                        <description>Selects channel 14</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_15</name>
                                        <description>Selects channel 15</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_16</name>
                                        <description>Selects channel 16</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_17</name>
                                        <description>Selects channel 17</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_18</name>
                                        <description>Selects channel 18</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_19</name>
                                        <description>Selects channel 19</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_20</name>
                                        <description>Selects channel 20</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_21</name>
                                        <description>Selects channel 21</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_22</name>
                                        <description>Selects channel 22</description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_23</name>
                                        <description>Selects channel 23</description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_24</name>
                                        <description>Selects channel 24</description>
                                        <value>0x18</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_25</name>
                                        <description>Selects channel 25</description>
                                        <value>0x19</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_26</name>
                                        <description>Selects channel 26</description>
                                        <value>0x1A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_27</name>
                                        <description>Selects channel 27</description>
                                        <value>0x1B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_28</name>
                                        <description>Selects channel 28</description>
                                        <value>0x1C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_29</name>
                                        <description>Selects channel 29</description>
                                        <value>0x1D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_30</name>
                                        <description>Selects channel 30</description>
                                        <value>0x1E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CHAN_31</name>
                                        <description>Selects channel 31</description>
                                        <value>0x1F</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIG</name>
                            <description>Trigger policy. Indicates if a trigger will be needed to step to the next MEMCTL in the sequence or to perform next conversion in the case of repeat single channel conversions.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>AUTO_NEXT</name>
                                        <description>Next conversion is automatic</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRIGGER_NEXT</name>
                                        <description>Next conversion requires a trigger</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>VRSEL</name>
                            <description>Voltage reference selection. VEREFM must be connected to on-board ground when external reference option is selected.
Note: Writing value 0x3 defaults to INTREF.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>VDDA_VSSA</name>
                                        <description>VDDA reference</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTREF_VREFM</name>
                                        <description>External reference from pin</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INTREF_VSSA</name>
                                        <description>Internal reference</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VDDA_VREFM</name>
                                        <description>VDDA and VREFM connected to VREF+ and VREF- of ADC</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INTREF_VREFM</name>
                                        <description>INTREF and VREFM connected to VREF+ and VREF- of ADC</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WINCOMP</name>
                            <description>Enable window comparator.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BCSEN</name>
                            <description>Enable burn out current source.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>AVGEN</name>
                            <description>Enable hardware averaging.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Averaging disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Averaging enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STIME</name>
                            <description>Selects the source of sample timer period between SCOMP0 and SCOMP1.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_SCOMP0</name>
                                        <description>Select SCOMP0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_SCOMP1</name>
                                        <description>Select SCOMP1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>ADC0_STATUS</name>
                    <description>Status Register</description>
                    <addressOffset>0x1340</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>Busy. This bit indicates that an active ADC sample or conversion operation is in progress.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>IDLE</name>
                                        <description>No ADC sampling or conversion in progress.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ACTIVE</name>
                                        <description>ADC sampling or conversion is in progress.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REFBUFRDY</name>
                            <description>Indicates reference buffer is powered up and ready.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOTREADY</name>
                                        <description>Not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READY</name>
                                        <description>Ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
